import 'package:flutter/material.dart';

import 'data/models/netsuke_model.dart';

final List<NetsukeModel> netsukeList = [
  NetsukeModel(
    "1",
    "Нэцкэ Фукурокудзю",
    "Пpeдcтaвляeт coбoй cтapцa c длиннoй бopoдoй и бoльшoй гoлoвoй. Фукуpoкудзю зaщищaeт вcex дoмoчaдцeв oт бoлeзнeй и дapуeт им cчacтливую жизнь.",
    const AssetImage("assets/images/Fukurokuju.webp"),
  ),
  NetsukeModel(
    "2",
    "Овца",
    "Коза символизирует мягкость, нежность и чувствительность. Однако, при всём этом она обладает чувством собственного достоинства и не пасует перед препятствиями.  Также коза является защитницей, обладающей хорошей интуицией и ясновидением.",
    const AssetImage("assets/images/Sheep.webp"),
  ),
  NetsukeModel(
    "3",
    "Собака",
    "Собака является символом храбрости и отваги, справедливости и бескорыстия. Собака с самых давних времён является верным спутником человека. Она в любой момент готова прийти на помощь и защитить своего хозяина.",
    const AssetImage("assets/images/Dog.webp"),
  ),
  NetsukeModel(
    "4",
    "Вельможа",
    "Символика Нэцкэ Вельможа включает в себя образ власти, достатка и культуры. Обычно эти фигурки изображаются с знаками богатства, такими как вееры, богато украшенные одежды, а также другими предметами, которые ассоциируются с аристократическим образом жизни, например, чашами для чая и кистями для письма.",
    const AssetImage("assets/images/Servant.webp"),
  ),
  NetsukeModel(
    "5",
    "Хотэй",
    "Cимвол счастья, общения. Славится как божество, исполняющее желания. Есть поверье: если 300 раз погладить Хотэя по округлому животу и мысленно думать о желании – оно сбудется. Классическая фигурка – это изображение полного человечка без волос и бороды, с мешком в руках. Иногда скульптуру дополняют монетами, веером. жемчужиной или даже дареным конем.",
    const AssetImage("assets/images/Xotei.webp"),
  ),
  NetsukeModel(
    "6",
    "Дракон",
    "Этo oдин из caмыx cильныx oбepeгoв. Дpaкoн зaщищaeт вcex oбитaтeлeй дoмa oт нeгaтивнoгo мaгичecкoгo вoздeйcтвия, злыx cил и энepгeтичecкиx вaмпиpoв.",
    const AssetImage("assets/images/Dragon.webp"),
  ),
];
